#data type % variable
str#string ข้อความ ตัวอักษร ' "" ''' 
#number integer จำนวนเต็ม float ทศนิยม
int
float
bool#boolean True, False
list#Lists แสดงเป็น objects หรือโครงสร้าง
'''
List (รายการที่เรียงลำดับได้)
โครงสร้าง: เก็บข้อมูลใน
ประกาศ: ใช้ `[]
คุณสมบัติเด่น:
สามารถเก็บค่าที่มีประเภทต่างกันได้ เช่น [1, "Hello", 3.14]
เข้าถึงข้อมูลด้วยดัชนี (index) เช่น my_list[0]
เพิ่ม/ลบข้อมูลด้วยเมธอด เช่น append, insert, remove, และ pop
'''
dict#dictionaries
'''
Dict (พจนานุกรม)
โครงสร้าง: เก็บข้อมูลแบบคู่ key:value ซึ่ง key ต้องไม่ซ้ำและมีลำดับใน Python 3.7+
ประกาศ: ใช้ {}
คุณสมบัติเด่น:
ใช้ key ในการเข้าถึงข้อมูล เช่น my_dict["name"]
เพิ่ม/ลบคู่ข้อมูลได้ เช่น my_dict["age"] = 25
'''
tuple#Tuples
'''
 Tuple (ทูเพิล)
โครงสร้าง: เก็บข้อมูลในรูปแบบลำดับ (ordered) แต่แก้ไขไม่ได้ (immutable)
ประกาศ: ใช้ ()
คุณสมบัติเด่น:
มีประสิทธิภาพสูงกว่า list เมื่อใช้กับข้อมูลที่ไม่ต้องการเปลี่ยนแปลง
สามารถใช้เป็น key ใน dict ได้เพราะเป็น immutable
'''
set#set
'''
Set (เซ็ต)
โครงสร้าง: เก็บข้อมูลแบบไม่เรียงลำดับ (unordered) และไม่มีข้อมูลซ้ำ (unique values)
ประกาศ: ใช้ {} (แต่ต้องไม่มี key:value เหมือน dict)
คุณสมบัติเด่น:
ใช้สำหรับการดำเนินการเชิงคณิตศาสตร์ เช่น union, intersection, และ difference
ไม่สามารถเข้าถึงค่าด้วยดัชนีได้
'''
